performance/test-order.yaml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 30
      arrivalRate: 20
      name: "预热阶段"
    - duration: 60
      arrivalRate: 50
      name: "持续负载"
    - duration: 60
      arrivalRate: 100
      name: "高负载"
  plugins:
    metrics-by-endpoint: {}
scenarios:
  - name: "创建订单流程"
    flow:
      - post:
          url: "/api/orders"
          headers:
            Authorization: "Bearer eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJ1c2VySWQiOjM1LCJyb2xlIjoiY3VzdG9tZXIiLCJpYXQiOjE3NzkwOTE0NDYsImV4cCI6MTc3OTY5NjI0Nn0.KXHmGrmIGsCG6s__eHr6i4uNfH9HNI0hrqw3rLr4P88"
            Content-Type: "application/json"
          json:
            table_id: 38
            items:
              - dish_id: 4
                quantity: 2
                price: 5.0
                dish_name: "羊肉串"